In [29]:
import sqlite3
import IPython.display
import pandas as pd

data_dir = 'pomona_transit.db'

def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        return conn
    except sqlite3.Error as e:
        print(e)

    return conn

def close_connection(conn):
    """ close a database connection
    :param conn: Connection object
    """
    if conn:
        conn.close()

create_connection(data_dir)

# Display each table in the database
conn = create_connection(data_dir)
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

for table_name in tables:
    table_name = table_name[0]
    query = f"SELECT * FROM {table_name};"
    df = pd.read_sql_query(query, conn)
    print(f"Table: {table_name}")
    IPython.display.display(df)
    print("\n")

Table: Trip

   TripNumber StartLocationName DestinationName
0           1       Chino Hills         Mt. SAC
1           2             Narod  Temple/Diamond
2           3       Chino Hills        La Verne

Table: TripOffering

,TripNumber,Date,ScheduledStartTime,ScheduledArrivalTime,DriverName,BusID
0,2,2026-01-14,09:30,10:30,Dan Smith,103
1,3,2026-01-14,11:00,12:00,Sara Castillo,103
2,2,2026-01-15,09:30,10:30,Jim Arlington,102

Table: Bus

   BusID                   Model  Year
0    102       Chevrolet Express  2020
1    103  Mercedes-Benz Sprinter  2019
2    104           Liberty Coach  2026

Table: Driver

      DriverName DriverTelephoneNumber
0  Jim Arlington          909-999-2395
1      Dan Smith          840-314-4393
2  Juan Martinez          909-394-1963
3  Sara Castillo          909-555-0198
4      Eric Chen          626-459-1356

Table: Stop

    StopNumber                      StopAddress
0            1     123 Main St, Chino Hills, CA
1            2    3012 W Temple Ave, Pomona, CA
2            3    3801 W Temple Ave, Pomona, CA
3            4     1100 N Grand Ave, Walnut, CA
4            5   5650 Mission Blvd, Ontario, CA
5            6  1195 E Mission Blvd, Pomona, CA
6            7   101 W Mission Blvd, Pomona, CA
7            8    3012 W Temple Ave, Pomona, CA
8            9     123 Main St, Chino Hills, CA
9           10   101 W Mission Blvd, Pomona, CA
10          11     1908 N White Ave, Pomona, CA
11          12          2252 D St, La Verne, CA

Table: ActualTripStopInfo

,TripNumber,Date,ScheduledStartTime,StopNumber,ScheduledArrivalTime,ActualStartTime,ActualArrivalTime,NumberOfPassengerIn,NumberOfPassengerOut
0,1,2026-01-14,08:00,1,08:10,08:05,08:12,3,0
1,1,2026-01-14,08:00,2,08:20,08:15,08:22,2,1
2,1,2026-01-14,08:00,3,08:30,08:25,08:32,4,0
3,2,2026-01-14,09:30,5,09:50,09:45,09:52,5,0
4,2,2026-01-14,09:30,6,10:10,10:05,10:12,3,2
5,2,2026-01-14,09:30,7,10:30,10:25,10:32,4,1
6,3,2026-01-14,11:00,9,11:20,11:15,11:22,6,0
7,3,2026-01-14,11:00,10,11:40,11:35,11:42,2,3
8,3,2026-01-14,11:00,11,12:00,11:55,12:02,5,1
9,2,2026-01-15,09:30,5,09:50,09:31,09:55,20,3

Table: TripStopInfo

    TripNumber  StopNumber  SequenceNumber  DrivingTime
0            1           1               1            5
1            1           2               2           10
2            1           3               3           10
3            1           4               4           10
4            2           5               1           15
5            2           6               2           15
6            2           7               3           15
7            2           8               4           15
8            3           9               1           20
9            3          10               2           10
10           3          11               3           10
11           3          12               4           20